<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
	세션(session)의 특징
	= 세션은 서버에서 관리하는 사용자를 위한 저장소이다.
	= 세션은 서버에 총 1개 존재한다.
	= 세션에서 각 사용자는 16진수 32자리로 구성된 세션ID로 구분한다.
	= 웹 서비스에서는 사용자가 Browser이다.
	
	= 세션에 저장된 정보는 사용자가 임의로 볼 수 없다.
	= 보안 수준이 매우 높음
	= 가장 중요한 정보를 이곳에 저장

	= 1개의 세션으로 모든 사용자 정보를 관리해야 한다.
	= 사용자가 늘어날 수록 저장해야할 정보가 많아진다.
	= 대규모 서비스일 수록 세션을 안쓰려고 노력하는 편이다.
	
	= 일정시간동안 요청이없는 세션은 자동으로 소멸 처리가 된다.
	= 시간은 web.xml 파일에서 지정이 가능하다.
	
	= 이러한 저장소를 scope 객체라고 부른다(page, request, session, application)
	
	= (주의) 로그인과 세션은 동일한 개념이 아니므로 만료시 꼭 소멸시킬 필요가 없다
 --%>
 
<h1>세션 ID : <%=session.getId() %></h1>
<h1>신규 세션? : <%=session.isNew() %></h1>


